<a href="https://colab.research.google.com/github/suryagokul/Data-Science-Portfolio/blob/master/Fill_missing_values_using_Random_Forest.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Fill missing values using Random Forest

In [139]:
from seaborn import load_dataset

import pandas as pd

In [140]:
df = load_dataset('titanic')

In [141]:
df.isnull().any()

survived       False
pclass         False
sex            False
age             True
sibsp          False
parch          False
fare           False
embarked        True
class          False
who            False
adult_male     False
deck            True
embark_town     True
alive          False
alone          False
dtype: bool

In [142]:
df.shape

(891, 15)

In [143]:
df['age'].isnull().sum()

177

**Splitting age into with nan values and without nan values**

In [144]:
age_with_nan = df[df.age.isnull()]

In [145]:
age_with_nan[:3]

    survived  pclass     sex  age  ...  deck  embark_town  alive alone
5          0       3    male  NaN  ...   NaN   Queenstown     no  True
17         1       2    male  NaN  ...   NaN  Southampton    yes  True
19         1       3  female  NaN  ...   NaN    Cherbourg    yes  True

[3 rows x 15 columns]

In [146]:
age_without_nan = df[df.age.isnull()==False]

In [147]:
age_without_nan[:6]

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True
6         0       1    male  54.0  ...     E  Southampton     no   True

[6 rows x 15 columns]

In [148]:
age_without_nan.shape

(714, 15)

**Taking Some Independent Variables to predict the age**

In [149]:
variables = ['pclass', 'sibsp', 'parch', 'fare', 'age']

In [150]:
one_hot_embarked = pd.get_dummies(age_with_nan['embarked'])
one_hot_sex = pd.get_dummies(age_with_nan['sex'])

age_with_nan = age_with_nan[variables]

age_with_nan = pd.concat([age_with_nan,one_hot_embarked,one_hot_sex],axis=1)

In [151]:
one_hot_embarked = pd.get_dummies(age_without_nan['embarked'])
one_hot_sex = pd.get_dummies(age_without_nan['sex'])

age_without_nan = age_without_nan[variables]

age_without_nan = pd.concat([age_without_nan,one_hot_embarked,one_hot_sex],axis=1)

In [152]:
age_without_nan[:3]

   pclass  sibsp  parch     fare   age  C  Q  S  female  male
0       3      1      0   7.2500  22.0  0  0  1       0     1
1       1      1      0  71.2833  38.0  1  0  0       1     0
2       3      0      0   7.9250  26.0  0  0  1       1     0

**By using RandomForest Regressor training our model with age which doesnot have nan values which we had already splitted and our independent features are our variables which are taken in a list.**

In [153]:
from sklearn.ensemble import RandomForestRegressor

In [154]:
independentVariables = ['pclass', 'female', 'male', 'sibsp', 'parch', 'fare', 'C', 'Q', 'S']


rr = RandomForestRegressor()

rr.fit(age_without_nan[independentVariables],age_without_nan['age'])

RandomForestRegressor(bootstrap=True, ccp_alpha=0.0, criterion='mse',
                      max_depth=None, max_features='auto', max_leaf_nodes=None,
                      max_samples=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=1,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      n_estimators=100, n_jobs=None, oob_score=False,
                      random_state=None, verbose=0, warm_start=False)

In [155]:
generated_age_values = rr.predict(age_with_nan[independentVariables])

gl = list(generated_age_values)

len(gl)

177

In [156]:
import numpy as np

age_with_nan['age'].replace({np.nan:gl},inplace=True)

In [157]:
age_with_nan.age.isnull().sum(),age_without_nan.age.isnull().sum()

(0, 0)

In [159]:
df1 = pd.concat([age_without_nan,age_with_nan],axis=0)

df1.head(6)

   pclass  sibsp  parch     fare   age  C  Q  S  female  male
0       3      1      0   7.2500  22.0  0  0  1       0     1
1       1      1      0  71.2833  38.0  1  0  0       1     0
2       3      0      0   7.9250  26.0  0  0  1       1     0
3       1      1      0  53.1000  35.0  0  0  1       1     0
4       3      0      0   8.0500  35.0  0  0  1       0     1
6       1      0      0  51.8625  54.0  0  0  1       0     1

In [160]:
df1['age'].iloc[5]    # Before there is null value in location 5.

54.0

In [134]:
df1.age.isnull().sum()

0

Finally our age feature has no nan values as shown above.So,this is also one of the method to fill nan values.